main-init.org
#+STARTUP: content
#+PROPERTY: header-args  :tangle yes :comments org
* Emacs setup
  My configurations are based on [[https://github.com/jwiegley/use-package][~use-package~]] which
  combines the loading of a package along with its configuration.
  I also rely on ~(package-install)~ to download extra packages.
  
  This file is written with [[https://orgmode.org/][org-mode]] and then [[https://orgmode.org/manual/Extracting-source-code.html#Extracting-source-code][=tangled=]] to 
  produce the actual source.

** A few setup things  
  
   You need to do a few things to get emacs to load
   this file, =main-init.el=:

** ~/.emacs: where it starts 
   I have this in my ~/.emacs and ~/.xemacs/init.el:
   
   #+BEGIN_EXAMPLE
   (add-to-list 'load-path "~/usr/emacs")
   (require 'main-init)
   #+END_EXAMPLE
** main-init.el: main configuration
   I've moved almost all the customization into
   ~main-init.el~ to avoid various emacs
   commands from changing this file.
*** Preamble
    This is at the beginning of main-init.el:
    #+BEGIN_SRC emacs-lisp
      ;; This file is generated from main-init.org
      ;; using (org-babel-tangle).  Do not
      ;; make changes in this file; they'll be lost!
      (provide 'main-init)
    #+END_SRC

*** Profile startup times
    This is from a good article https://blog.d46.us/advanced-emacs-startup/
    about speeding up emacs startup.

    Use a hook so the message doesn't get clobbered by other messages.
    #+BEGIN_SRC emacs-lisp
      (add-hook 'emacs-startup-hook
                (lambda ()
                  (message "Emacs ready in %s with %d garbage collections."
                           (format "%.2f seconds"
                                   (float-time
                                    (time-subtract after-init-time before-init-time)))
                           gcs-done)))
    #+END_SRC
*** GC threshold
    Temporarily increase GC threshold to 100MB then reduce to 800MB
    (was 800KB) after startup.
    #+BEGIN_SRC emacs-lisp
      (setq gc-cons-threshold (* 100 1000 1000))
      (add-hook 'after-init-hook (lambda ()
                                   (setq gc-cons-threshold (* 8 1000 1000))))
    #+END_SRC
*** Setup proxies, certificates for package installation
    To get ~package-install~ to work you may need to setup some
    proxies and some SSL certificates for those proxies

    Add certificate for corp proxies.  No problem if file doesn't exist.

    #+BEGIN_SRC emacs-lisp
      (require 'gnutls)
      (add-to-list 'gnutls-trustfiles (expand-file-name "~/.ssh/BBrootNEW.cer"))
    #+END_SRC

    This is specific to a corp desktop pc keyed off
    the assumption I only ever run cygwin in that environment.

    #+BEGIN_SRC emacs-lisp
      (when (or (string-equal system-type "windows-nt")
                (string-equal system-type "cygwin"))
        (setq password-cache-expiry nil)
        (setq url-proxy-services '(("http" . "proxy.bloomberg.com:81"))))
    #+END_SRC

    Assume if this is Mac OS X that I've setup nodeproxy for corp
    access.

    #+BEGIN_SRC emacs-lisp
      ;; (when (eq system-type 'darwin)
      ;;   (setq url-proxy-services '(("http" . "localhost:8888")
      ;;                              ("https" . "localhost:8888"))))
    #+END_SRC
*** Do some weird Mac OS X stuff for my environment
#+BEGIN_SRC emacs-lisp
  (when (eq system-type 'darwin)
      (setenv "PATH" "/usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/Applications/Emacs.app/Contents/MacOS/bin-x86_64-10_10:/Applications/Emacs.app/Contents/MacOS/libexec-x86_64-10_10")
      ;(setq prog-mode-hook '(pw/trunc-lines outline-minor-mode display-line-numbers-mode))
      (setq exec-path (cons "/usr/local/bin" exec-path)))
#+END_SRC
*** Configure frame geometry, fonts, transparency,

#+BEGIN_SRC emacs-lisp
  (when (display-graphic-p)
    (setq initial-frame-alist
          '((width . 110)
            (height . 60)
            (top . 29)
            (left . 88)))
    (setq default-frame-alist
          '((width . 110)
            (height . 60)
            (top . 29)
            (left . 1.0))))
  (when (eq 'ns (window-system))
    (add-to-list 'default-frame-alist
                 '(font . "SF Mono-16"))
    (add-to-list 'default-frame-alist
                 '(alpha . (90 . 70))))
#+END_SRC

*** package
    Use the emacs packaging system to automatically install some packages

    #+BEGIN_SRC emacs-lisp
      (require 'package)
      (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
      ;; (add-to-list 'package-archives
      ;;              '("melpa-stable" . "https://stable.melpa.org/packages/") t)
      (package-initialize)
    #+END_SRC
*** Setup use-package
   You may need to =M-x package-install use-package= before
   any of this works
   
   If a package is not available then ~use-package~ ignores it.
   You can also not use a package by adding :disabled t to use-package

   #+BEGIN_SRC emacs-lisp
     (unless (package-installed-p 'use-package)
       (package-refresh-contents)
       (package-install 'use-package))
     (eval-when-compile
       (require 'use-package))
    #+END_SRC

   I also like having ~use-package~ collect some info about
   the loaded packages and how long they take to load.  You
   can see the results with =M-x use-package-report=.

   #+BEGIN_SRC emacs-lisp
     (setq use-package-compute-statistics t)
   #+END_SRC

** Standard packages loaded immediately

   This section is for standard packages that are loaded immediately

*** bind-key
    Using bind-key lets you run describe-personal-keybindings
    which is a nice way of keep track of what you've changed.
    #+BEGIN_SRC emacs-lisp
    (use-package bind-key
      :bind (
             ("C-c G" . 'goto-line)
             ("C-c o" . 'other-frame)
             ("<wheel-left>" . 'ignore)
             ("<wheel-right>" . 'ignore)
             ("<double-wheel-left>" . 'ignore)
             ("<double-wheel-right>" . 'ignore)
             ("<triple-wheel-left>" . 'ignore)
             ("<triple-wheel-right>" . 'ignore)
             ))
    #+END_SRC

*** bookmark
    You can save bookmarks with =C-x r m= and jump to them wih =C-x r b=
    This makes them save automatically

    #+BEGIN_SRC emacs-lisp
    (use-package bookmark
      :defer 5
      :config
      (setq bookmark-save-flag 1))
    #+END_SRC
*** delsel
    I can't handle the active region getting deleted

    #+BEGIN_SRC emacs-lisp
    (use-package delsel
      :defer 5
      :config
      (delete-selection-mode -1))
    #+END_SRC

*** desktop
    This causes the set of files being visited to be restored
    on startup.
    #+BEGIN_SRC emacs-lisp
      (use-package desktop
        :config
        (progn
          (setq desktop-save t)
          (setq desktop-dirname "~/.emacs.d/")
          (setq desktop-restore-frames nil)
          (setq desktop-restore-eager 5)
          (setq desktop-restore-in-current-display t)
          (setq desktop-lazy-verbose nil)
          (setq desktop-lazy-idle-delay 20)
          (setq desktop-auto-save-timeout 7200)
          (setq desktop-files-not-to-save "^$")
          (setq desktop-load-locked-desktop t)
          (desktop-save-mode 1)
          (add-to-list 'desktop-modes-not-to-save 'Info-mode)
          (add-to-list 'desktop-modes-not-to-save 'dired-mode)
          ))
    #+END_SRC
*** display line numbers
    This is the built-in line numbers added with Emacs 26.1
    #+BEGIN_SRC emacs-lisp
      (use-package display-line-numbers
        :config
        (add-hook 'prog-mode-hook 'display-line-numbers-mode))
    #+END_SRC
*** executable
    This makes saving shell scripts automatically make
    them executable.  It's considered a shell script if
    it starts with #!

    #+BEGIN_SRC emacs-lisp
    (use-package executable
      :defer 2
      :config
      (add-hook 'after-save-hook
                'executable-make-buffer-file-executable-if-script-p))

    #+END_SRC

*** face-remap
    Change the font size in the current buffer (not the window)

    #+BEGIN_SRC emacs-lisp
    (use-package face-remap
      :defer 5
      :bind* (("C-c -" . text-scale-decrease)
              ("C-c +" . text-scale-increase)))
    #+END_SRC

*** jit-lock
    Setup lazy font locking

    #+BEGIN_SRC emacs-lisp
    (use-package jit-lock
      :defer 1
      :config
      (jit-lock-mode t))
    #+END_SRC

*** jka-cmpr-hook
    Make visiting a *.gz automatically uncompress file

    #+BEGIN_SRC emacs-lisp
    (use-package jka-cmpr-hook
      :defer 5
      :config
      (auto-compression-mode 1))
    #+END_SRC

*** mwheel
    Make sure the mouse wheel scrolls

    #+BEGIN_SRC emacs-lisp
    (use-package mwheel
      :defer 1
      :config
      (progn
        (setq mouse-wheel-scroll-amount '(1 ((shift) . 1) ((control))))
        (setq mouse-wheel-progressive-speed nil)
        (mwheel-install)))
    #+END_SRC

*** outline

    #+BEGIN_SRC emacs-lisp
    (use-package outline
      :defer 5
      :hook (prog-mode . outline-minor-mode))
    #+END_SRC

