main-init.el
;; Preamble
;;     This is at the beginning of main-init.el:

;; This file is generated from main-init.org
;; using (org-babel-tangle).  Do not
;; make changes in this file; they'll be lost!
(provide 'main-init)

;; Profile startup times
;;     This is from a good article https://blog.d46.us/advanced-emacs-startup/
;;     about speeding up emacs startup.

;;     Use a hook so the message doesn't get clobbered by other messages.

(add-hook 'emacs-startup-hook
          (lambda ()
            (message "Emacs ready in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))

;; GC threshold
;;     Temporarily increase GC threshold to 50MB then reduce to 800KB after startup.

(setq gc-cons-threshold (* 50 1000 1000))    
(add-hook 'after-init-hook (lambda ()
                             (setq gc-cons-threshold (* 800 1000))))

;; Setup proxies, certificates for package installation
;;     To get ~package-install~ to work you may need to setup some
;;     proxies and some SSL certificates for those proxies

;;     Add certificate for corp proxies.  No problem if file doesn't exist.


(require 'gnutls)
(add-to-list 'gnutls-trustfiles (expand-file-name "~/.ssh/BBrootNEW.cer"))



;; This is specific to a corp desktop pc keyed off
;; the assumption I only ever run cygwin in that environment.


(require 'gnutls)
(add-to-list 'gnutls-trustfiles (expand-file-name "~/.ssh/BBrootNEW.cer"))
(when (or (string-equal system-type "windows-nt")
          (string-equal system-type "cygwin"))
  (setq password-cache-expiry nil)
  (setq url-proxy-services '(("http" . "proxy.bloomberg.com:81"))))



;; Assume if this is Mac OS X that I've setup nodeproxy for corp
;; access.


(when (eq system-type 'darwin)
  (setq url-proxy-services '(("http" . "localhost:8888")
                             ("https" . "localhost:8888"))))

;; Do some weird Mac OS X stuff for my environment

(when (eq system-type 'darwin)
    (setenv "PATH" "/usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/Applications/Emacs.app/Contents/MacOS/bin-x86_64-10_10:/Applications/Emacs.app/Contents/MacOS/libexec-x86_64-10_10")
    ;(setq prog-mode-hook '(pw/trunc-lines outline-minor-mode display-line-numbers-mode))
    (setq exec-path (cons "/usr/local/bin" exec-path)))

;; Configure frame geometry, fonts, transparency,


(when (display-graphic-p)
  (setq initial-frame-alist
        '((width . 110)
          (height . 60)
          (top . 29)
          (left . 88)))
  (setq default-frame-alist
        '((width . 110)
          (height . 60)
          (top . 29)
          (left . 1.0))))
(when (eq 'ns (window-system))
  (add-to-list 'default-frame-alist
               '(font . "SF Mono-16"))
  (add-to-list 'default-frame-alist
               '(alpha . (90 . 70))))

;; package
;;     Use the emacs packaging system to automatically install some packages


(require 'package)
(add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
;; (add-to-list 'package-archives
;;              '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(package-initialize)

;; Setup use-package
;;    You may need to =M-x package-install use-package= before
;;    any of this works
   
;;    If a package is not available then ~use-package~ ignores it.
;;    You can also not use a package by adding :disabled t to use-package


(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-when-compile
  (require 'use-package))



;; I also like having ~use-package~ collect some info about
;; the loaded packages and how long they take to load.  You
;; can see the results with =M-x use-package-report=.


(setq use-package-compute-statistics t)

;; bind-key
;;     Using bind-key lets you run describe-personal-keybindings
;;     which is a nice way of keep track of what you've changed.

(use-package bind-key
  :bind (
         ("C-c G" . 'goto-line)
         ("C-c o" . 'other-frame)
         ("<wheel-left>" . 'ignore)
         ("<wheel-right>" . 'ignore)
         ("<double-wheel-left>" . 'ignore)
         ("<double-wheel-right>" . 'ignore)
         ("<triple-wheel-left>" . 'ignore)
         ("<triple-wheel-right>" . 'ignore)
         ))

;; bookmark
;;     You can save bookmarks with =C-x r m= and jump to them wih =C-x r b=
;;     This makes them save automatically


(use-package bookmark
  :defer 5
  :config
  (setq bookmark-save-flag 1))

;; delsel
;;     I can't handle the active region getting deleted


(use-package delsel
  :defer 5
  :config
  (delete-selection-mode -1))

;; desktop
;;     This causes the set of files being visited to be restored
;;     on startup.

(use-package desktop
  ;:defer 10
  :defer 1
  :config
  (progn
    (setq desktop-save t)
    (setq desktop-dirname "~/.emacs.d/")
    (setq desktop-restore-frames nil)
    (setq desktop-restore-eager 5)
    (setq desktop-restore-in-current-display t)
    (setq desktop-lazy-verbose nil)
    (setq desktop-lazy-idle-delay 20)
    (setq desktop-auto-save-timeout 7200)
    (setq desktop-files-not-to-save "^$")
    (setq desktop-load-locked-desktop t)
    (desktop-save-mode 1)
    (add-to-list 'desktop-modes-not-to-save 'Info-mode)
    (add-to-list 'desktop-modes-not-to-save 'dired-mode)
    ))

;; display line numbers
;;     This is the built-in line numbers added with Emacs 26.1

(use-package display-line-numbers
  :config
  (add-hook 'prog-mode-hook 'display-line-numbers-mode))

;; executable
;;     This makes saving shell scripts automatically make
;;     them executable.  It's considered a shell script if
;;     it starts with #!


(use-package executable
  :defer 2
  :config
  (add-hook 'after-save-hook
            'executable-make-buffer-file-executable-if-script-p))

;; face-remap
;;     Change the font size in the current buffer (not the window)


(use-package face-remap
  :defer 5
  :bind* (("C-c -" . text-scale-decrease)
          ("C-c +" . text-scale-increase)))

;; jit-lock
;;     Setup lazy font locking


(use-package jit-lock
  :defer 1
  :config
  (jit-lock-mode t))

;; jka-cmpr-hook
;;     Make visiting a *.gz automatically uncompress file


(use-package jka-cmpr-hook
  :defer 5
  :config
  (auto-compression-mode 1))

;; mwheel
;;     Make sure the mouse wheel scrolls


(use-package mwheel
  :defer 1
  :config
  (progn
    (setq mouse-wheel-scroll-amount '(1 ((shift) . 1) ((control))))
    (setq mouse-wheel-progressive-speed nil)
    (mwheel-install)))

;; outline


(use-package outline
  :defer 5
  :hook (prog-mode . outline-minor-mode))

;; paren
