main-init.org
*** paren
    Highlight matching paren

    #+BEGIN_SRC emacs-lisp
      (use-package paren
        :defer 5
        :config
        (progn
          (setq show-paren-when-point-in-periphery t)
          (show-paren-mode 1)))
    #+END_SRC

*** recentf
    #+BEGIN_SRC emacs-lisp
    (use-package recentf
      ;;
      ;; Save list of recently visited files
      :defer 5
      :config
      (progn
        (setq recentf-max-saved-items 100)
        (setq recentf-auto-cleanup 3600)    ;cleanup after idle 1hr
        (recentf-mode 1)))
    #+END_SRC

*** savehist
    #+BEGIN_SRC emacs-lisp
    (use-package savehist
      ;;
      ;; Save emacs's internal command history.
      :defer 5
      :config
      (progn
        (setq savehist-additional-variables
              '(compile-command
                grep-find-history
                grep-history
                grep-regexp-history
                grep-files-history))
        (savehist-mode 1)))
    #+END_SRC

*** saveplace
    This records the location of every file you visit and
    restores when you vist a file, goes to that location.  I also save
    the file every couple hours because I don't always quit emacs 

    #+BEGIN_SRC emacs-lisp
    (use-package saveplace
      :defer 5
      :config
      (progn
        (setq-default save-place t)
        (setq save-place-limit nil)
        (run-at-time 3600  3600 'save-place-alist-to-file)))
    #+END_SRC

*** server
    Make it so $EDITOR can popup in this emacs

    #+BEGIN_SRC emacs-lisp
    (use-package server
      :config
      (progn
        (if (not (string-match "emacsclient" (or (getenv "EDITOR") "")))
            (setenv "EDITOR" "emacsclient"))
        (message "server-start")
        (server-start)))
    #+END_SRC

*** tool-bar
    Turn the toolbar off.  I also turn it off in my .Xdefaults with:
    
    Emacs.toolBar:            0

    which keeps it from displaying on startup
    #+BEGIN_SRC emacs-lisp
      (use-package tool-bar
        :config
        (tool-bar-mode -1))
    #+END_SRC

*** uniquify
    Make it so buffers with the same name are are made unique by added
    directory path and killing a buffer renames all of them.
    #+BEGIN_SRC emacs-lisp
    (use-package uniquify
      :defer 1
      :config
      (progn
        (setq uniquify-buffer-name-style 'post-forward)
        (setq uniquify-after-kill-buffer-p t)))

    #+END_SRC

*** xterm-mouse-mode
    Makes the mouse work when running in an xterm/iterm or other
    terminal emulator.  Only enabled when no graphics
    #+BEGIN_SRC emacs-lisp
      (use-package xt-mouse
        :unless (display-graphic-p)
        :config
        (xterm-mouse-mode))
    #+END_SRC
** Non-standard packages loaded immediately

   These are non-standard packages that are
   loaded immediately so have some affect on startup

*** bb-style
    Bloomberg C++ coding style
    #+BEGIN_SRC emacs-lisp
    (use-package bb-style
      :config
      (progn
        ;; Use bb-style for C/C++; associate .h files with c++-mode instead of
        ;; c-mode
        (setq c-default-style "bb")
        (setq c-tab-always-indent nil)
        (add-to-list 'auto-mode-alist '("\\.h$" . c++-mode))
      ))
    #+END_SRC

*** delight

    This package makes it easy to hide minor
    modes in the modeline.  Uses for :diminish
    #+BEGIN_SRC emacs-lisp
    (use-package delight
      :defer 5
      :ensure t)
    #+END_SRC

*** ivy
    ~ivy~ changes completion so that matches are
    found via regular expressions and matches are
    navigable by moving up and down lines.  Replaces
    ~ido~ and ~iswitchb~.
    #+BEGIN_SRC emacs-lisp
    (use-package ivy
      :ensure t
      :defer 1
      :delight ivy-mode
      :bind (("C-c C-r" . 'ivy-resume))
      :config (progn
                (setq ivy-wrap t)
                (setq ivy-use-virtual-buffers t)
                (setq ivy-count-format "(%d/%d) ")
                (ivy-mode)))
    #+END_SRC
    This adds some nice info when choosing buffers
    #+BEGIN_SRC emacs-lisp
      (use-package ivy-rich
        :after ivy
        :config (ivy-rich-mode 1))
    #+END_SRC
*** counsel
    ~counsel~ builds on completion for ivy but adds
    searches across files.
    #+BEGIN_SRC emacs-lisp
      (use-package counsel
        :after ivy
        :ensure t
        :delight counsel-mode
        :bind (("C-c g" .  'counsel-git)
               ("C-c j" .  'counsel-file-jump)
               ("C-c k" .  'counsel-ag)
               ("C-c s" .  'counsel-switch-to-shell-buffer)
               )
        :config 
        (progn (counsel-mode)
               (setq counsel-find-file-ignore-regexp "\\.*\\(pyc\\|.o\\|.tsk\\)$")))
    #+END_SRC

    And I have some hacks to be a little smarter when switching

    #+BEGIN_SRC emacs-lisp
      (use-package counsel-shell-switch
        :after counsel
        :bind (("C-c s" . 'pw/counsel-switch-to-shell-buffer)))
    #+END_SRC

*** swiper
    This changes incremental search to use ivy style completion
    but displays all the matching lines in the completion buffer.
    #+BEGIN_SRC emacs-lisp
    (use-package swiper
      :after ivy
      :ensure t
      :bind (("M-s" . 'swiper)))
    #+END_SRC

*** scratch-ext
    Make *scratch* buffers get saved

    #+BEGIN_SRC emacs-lisp
    (use-package scratch-ext
      :defer 5
      :ensure t
      :config
      (save-excursion
        (setq scratch-ext-log-directory "~/.emacs.d/scratch")
        (if (not (file-exists-p scratch-ext-log-directory))
            (mkdir scratch-ext-log-directory t))
        (scratch-ext-create-scratch)
        (set-buffer "*scratch*")
        (scratch-ext-restore-last-scratch)))
    #+END_SRC

*** toolkit-tramp

    #+BEGIN_SRC emacs-lisp
          (use-package toolkit-tramp
            :defer 60
            :config
            (progn
              (setq password-cache-expiry nil)
              (setq tramp-use-ssh-controlmaster-options nil)))
      
    #+END_SRC

** Standard packages that defer loading

   These packages are not loaded until they are used (e.g. minimal
   cost on startup)

*** compile
    Setup compilation buffers

    #+BEGIN_SRC emacs-lisp
    (use-package compile
      :bind ("C-c c" . compile)
      :config
      (progn
        (setq compilation-scroll-output 'first-error)))
    #+END_SRC

*** ansi-color
    #+BEGIN_SRC emacs-lisp
    (use-package ansi-color
      :after compile
      :config
      (progn
        (defun pw/colorize-compilation-buffer ()
          (let ((inhibit-read-only t))
            (ansi-color-apply-on-region compilation-filter-start (point-max))))
        (add-hook 'compilation-filter-hook 'pw/colorize-compilation-buffer)
        (setq ansi-color-names-vector ; better contrast colors
              ["black" "red4" "green4" "yellow4"
               "#8be9fd" "magenta4" "cyan4" "white"])
        (setq ansi-color-map (ansi-color-make-color-map))))
    #+END_SRC

*** ediff
    A nice graphical diff Make sure that ediff ignores all whitespace
    differences and highlights the individual differences

    #+BEGIN_SRC emacs-lisp
    (use-package ediff
      :commands ediff-load-version-control
      :bind (("C-c =" . pw/ediff-current))
      :config
      (progn
        (setq ediff-window-setup-function 'ediff-setup-windows-plain)
        (setq ediff-split-window-function 'split-window-horizontally)
        (setq ediff-diff-options "-w")
        (setq-default ediff-auto-refine 'on))
      :init
      (progn
        (defun pw/ediff-current (arg)
          "Run ediff-vc-internal on the current file against it's latest revision.
           If prefix arg, use it as the revision number"
          (interactive "P")
          (ediff-load-version-control t)
          (let ((rev (if arg (format "%d" arg) "")))
            (funcall
             (intern (format "ediff-%S-internal" ediff-version-control-package))
             rev "" nil)))))
    #+END_SRC

*** follow
    This makes a single file wrap around between two windows.
    Try ^X-3 and then move to the top or bottom of the window
    and the other window scrolls.  I bound F7 to do get
    rid of the other windows and split.

    #+BEGIN_SRC emacs-lisp
    (use-package follow
      :bind ("<f7>" . follow-delete-other-windows-and-split))
    #+END_SRC

