main-init.el
;;     Highlight matching paren


(use-package paren
  :defer 5
  :config
  (show-paren-mode 1))

;; recentf

(use-package recentf
  ;;
  ;; Save list of recently visited files
  :defer 5
  :config
  (progn
    (setq recentf-max-saved-items 100)
    (setq recentf-auto-cleanup 3600)    ;cleanup after idle 1hr
    (recentf-mode 1)))

;; savehist

(use-package savehist
  ;;
  ;; Save emacs's internal command history.
  :defer 5
  :config
  (progn
    (setq savehist-additional-variables
          '(compile-command
            grep-find-history
            grep-history
            grep-regexp-history
            grep-files-history))
    (savehist-mode 1)))

;; saveplace
;;     This records the location of every file you visit and
;;     restores when you vist a file, goes to that location.  I also save
;;     the file every couple hours because I don't always quit emacs 


(use-package saveplace
  :defer 5
  :config
  (progn
    (setq-default save-place t)
    (setq save-place-limit nil)
    (run-at-time 3600  3600 'save-place-alist-to-file)))

;; server
;;     Make it so $EDITOR can popup in this emacs


(use-package server
  :config
  (progn
    (if (not (string-match "emacsclient" (or (getenv "EDITOR") "")))
        (setenv "EDITOR" "emacsclient"))
    (message "server-start")
    (server-start)))

;; tool-bar
;;     Turn the toolbar off.  I also turn it off in my .Xdefaults with:
    
;;     Emacs.toolBar:            0

;;     which keeps it from displaying on startup

(use-package tool-bar
  :config
  (tool-bar-mode -1))

;; uniquify
;;     Make it so buffers with the same name are are made unique by added
;;     directory path and killing a buffer renames all of them.

(use-package uniquify
  :defer 1
  :config
  (progn
    (setq uniquify-buffer-name-style 'post-forward)
    (setq uniquify-after-kill-buffer-p t)))

;; bb-style
;;     Bloomberg C++ coding style

(use-package bb-style
  :defer 1
  :config
  (progn
    ;; Use bb-style for C/C++; associate .h files with c++-mode instead of
    ;; c-mode
    (setq c-default-style "bb")
    (setq c-tab-always-indent nil)
    (add-to-list 'auto-mode-alist '("\\.h$" . c++-mode))
  ))

;; delight

;;     This package makes it easy to hide minor
;;     modes in the modeline.  Uses for :diminish

(use-package delight
  :defer 5
  :ensure t)

;; ivy
;;     ~ivy~ changes completion so that matches are
;;     found via regular expressions and matches are
;;     navigable by moving up and down lines.  Replaces
;;     ~ido~ and ~iswitchb~.

(use-package ivy
  :ensure t
  :defer 1
  :delight ivy-mode
  :bind (("C-c C-r" . 'ivy-resume))
  :config (progn
            (setq ivy-wrap t)
            (setq ivy-use-virtual-buffers t)
            (setq ivy-count-format "(%d/%d) ")
            (ivy-mode)))


;; This adds some nice info when choosing buffers

(use-package ivy-rich
  :after ivy
  :config (ivy-rich-mode 1))

;; counsel
;;     ~counsel~ builds on completion for ivy but adds
;;     searches across files.

(use-package counsel
  :after ivy
  :ensure t
  :delight counsel-mode
  :bind (("C-c g" .  'counsel-git)
         ("C-c j" .  'counsel-file-jump)
         ("C-c k" .  'counsel-ag)
         ("C-c s" .  'counsel-switch-to-shell-buffer)
         )
  :config (progn (counsel-mode)))

;; swiper
;;     This changes incremental search to use ivy style completion
;;     but displays all the matching lines in the completion buffer.

(use-package swiper
  :after ivy
  :ensure t
  :bind (("M-s" . 'swiper)))

;; scratch-ext
;;     Make *scratch* buffers get saved


(use-package scratch-ext
  :defer 5
  :ensure t
  :config
  (save-excursion
    (setq scratch-ext-log-directory "~/.emacs.d/scratch")
    (if (not (file-exists-p scratch-ext-log-directory))
        (mkdir scratch-ext-log-directory t))
    (scratch-ext-create-scratch)
    (set-buffer "*scratch*")
    (scratch-ext-restore-last-scratch)))

;; toolkit-tramp


(use-package toolkit-tramp
  :defer 60
  :config
  (progn
    (setq password-cache-expiry nil)
    (setq tramp-use-ssh-controlmaster-options nil)))

;; compile
;;     Setup compilation buffers


(use-package compile
  :bind ("C-c c" . compile)
  :config
  (progn
    (setq compilation-scroll-output 'first-error)))

;; ansi-color

(use-package ansi-color
  :after compile
  :config
  (progn
    (defun pw/colorize-compilation-buffer ()
      (let ((inhibit-read-only t))
        (ansi-color-apply-on-region compilation-filter-start (point-max))))
    (add-hook 'compilation-filter-hook 'pw/colorize-compilation-buffer)
    (setq ansi-color-names-vector ; better contrast colors
          ["black" "red4" "green4" "yellow4"
           "#8be9fd" "magenta4" "cyan4" "white"])
    (setq ansi-color-map (ansi-color-make-color-map))))

;; ediff
;;     A nice graphical diff Make sure that ediff ignores all whitespace
;;     differences and highlights the individual differences


(use-package ediff
  :commands ediff-load-version-control
  :bind (("C-c =" . pw/ediff-current))
  :config
  (progn
    (setq ediff-window-setup-function 'ediff-setup-windows-plain)
    (setq ediff-split-window-function 'split-window-horizontally)
    (setq ediff-diff-options "-w")
    (setq-default ediff-auto-refine 'on))
  :init
  (progn
    (defun pw/ediff-current (arg)
      "Run ediff-vc-internal on the current file against it's latest revision.
       If prefix arg, use it as the revision number"
      (interactive "P")
      (ediff-load-version-control t)
      (let ((rev (if arg (format "%d" arg) "")))
        (funcall
         (intern (format "ediff-%S-internal" ediff-version-control-package))
         rev "" nil)))))

;; follow
;;     This makes a single file wrap around between two windows.
;;     Try ^X-3 and then move to the top or bottom of the window
;;     and the other window scrolls.  I bound F7 to do get
;;     rid of the other windows and split.


(use-package follow
  :bind ("<f7>" . follow-delete-other-windows-and-split))

;; grep
