main-init.org
*** grep
    ~rgrep~ recursively greps for a pattern.  It uses a key to specify
    filenames and ignores directories like CVS.  "cchh" is all C++
    files and headers.

    #+BEGIN_SRC emacs-lisp
    (use-package grep
      ;:bind (("C-c g" . grep))
      :defer 5
      :config
      (progn
        (setq grep-files-aliases
              '(("all" . "* .*")
                ("el" . "*.el")
                ("ch" . "*.[ch]")
                ("c" . "*.c")
                ("cc" . "*.cc *.cxx *.cpp *.C *.CC *.c++")
                ("cchh" . "*.cc *.[ch]xx *.[ch]pp *.[CHh] *.CC *.HH *.[ch]++")
                ("hh" . "*.hxx *.hpp *.[Hh] *.HH *.h++")
                ("h" . "*.h")
                ("l" . "[Cc]hange[Ll]og*")
                ("m" . "[Mm]akefile* *.mk")
                ("tex" . "*.tex")
                ("texi" . "*.texi")
                ("asm" . "*.[sS]")
                ("code" . "*.c *.C *.h *.cpp *.cc *.f *.py")))))
    #+END_SRC

*** hideshow
    Setup commands and menus to hide/show blocks of code
    #+BEGIN_SRC emacs-lisp
    (use-package hideshow
      :commands hs-minor-mode
      :init
      (progn
        (add-hook 'c++-mode-hook 'hs-minor-mode)
        (add-hook 'c-mode-hook 'hs-minor-mode)))
    #+END_SRC

*** org
    org-mode provides an outline, todo, diary, calendar like interface.
    #+BEGIN_SRC emacs-lisp
      (use-package org
        :mode ("\\.org\\'" . org-mode)
        :commands orgstruct-mode
        :delight orgstruct-mode
        :bind (("C-c l" . org-store-link)
               ("C-c a" . org-agenda)
               ("C-c r" . org-capture))
        :init (add-hook 'c-mode-common-hook 'orgstruct-mode)
        :config (progn
                  (setq org-export-backends '(ascii html icalendar latex md))
                  (setq org-list-allow-alphabetical t)))
    #+END_SRC

    Additionally, I have a number of customizations I like to use
    for org-mode.

    #+BEGIN_SRC emacs-lisp
    (use-package org-prefs
      :after org)
    #+END_SRC

*** tramp
    This provides remote access to files and shells.  
    #+BEGIN_SRC emacs-lisp
      (use-package tramp
        :config
        (setq tramp-use-ssh-controlmaster-options nil
              tramp-copy-size-limit 1024))
    #+END_SRC
*** discover (disabled)
    Add some nice menus to common commands.  
    See https://www.masteringemacs.org/article/discoverel-discover-emacs-context-menus
    #+BEGIN_SRC emacs-lisp
      (use-package discover
        :disabled t
        :config
        (global-discover-mode 1))
    #+END_SRC
*** whitespace
    Make "bad" whitespace be visible.  This causes tabs, and whitespace
    at beginning and end of the buffer as well as at the end of the
    line to highlight
    
    Use =M-x whitespace-cleanup= to fix all problems

    #+BEGIN_SRC emacs-lisp
    (use-package whitespace
      :bind ("C-c SPC" . whitespace-mode)
      :config
      (progn
        (setq whitespace-style '(face trailing tabs empty indentation::space lines-tail))
        (setq whitespace-line-column nil)))
    #+END_SRC

** Non-standard packages that defer loading 

   These packages are not loaded until used (e.g. minimal cost on
   startup)

*** anyins
    Freaky way to insert text
    1. Enter anyins-mode
    2. Move around; mark spots you want to insert text with RET
    3. To insert text

       a. =y= inserts each line from kill ring at each marked spot, or
       b.  =!= runs a shell command line 'seq -s ". \n" 1 3' generates
           numbers "1. "  "2. " "3. " and inserts it at each markets tpot
    #+BEGIN_SRC emacs-lisp
    (use-package anyins
      :ensure t
      :bind ("C-c i" . anyins-mode))
    #+END_SRC

*** beacon
    Highlight the line the point is on when the screen jumps around.

    DISABLED as it was distracting in a termina window
    #+BEGIN_SRC emacs-lisp
          (use-package beacon
            :disabled t
            :defer 15
            :config
            (progn
              (beacon-mode 1)
              (setq beacon-push-mark 35)
              (setq beacon-color "#666600")))
    #+END_SRC

*** comint-prefs
    
    Setup preferences for shell, compile and other comint based commands

    #+BEGIN_SRC emacs-lisp
    (use-package comint-prefs
      :after comint
      :commands (comint-for-pete dbx-for-pete comint-watch-for-password-prompt)
      :init
      (progn
        (add-hook 'comint-output-filter-functions 'comint-watch-for-password-prompt)
        (add-hook 'comint-mode-hook 'comint-for-pete)
        (add-hook 'dbx-mode-hook 'dbx-for-pete))  )
    #+END_SRC

*** csc-mode
    Bloomberg database schema
    #+BEGIN_SRC emacs-lisp
    (use-package csc-mode
      :mode ("\\.csc2$" . csc-mode))
    #+END_SRC

*** lrl-mode
    Bloomberg database params
    #+BEGIN_SRC emacs-lisp
    (use-package lrl-mode
      :mode ("\\.lrl\\'" . lrl-mode))
    #+END_SRC

*** magit
    
    Provide a way of interacting with a Git repository.
    
    Download package if not installed!
    #+BEGIN_SRC emacs-lisp
    (use-package magit
      :ensure t
      :bind (("C-c m" . magit-status)
             ("C-c C-m" . magit-dispatch-popup))
      :delight '(magit-wip-after-save-mode
                 magit-wip-after-save-local-mode
                 magit-wip-after-apply-mode
                 magit-wip-before-change-mode
                 auto-revert-mode)
      :config (progn
                (add-hook 'magit-status-headers-hook 'magit-insert-repo-header)
                (add-hook 'magit-status-headers-hook 'magit-insert-remote-header)
                (setq magit-commit-show-diff nil)
                (setq auto-revert-buffer-list-filter 'magit-auto-revert-repository-buffers-p)
                (remove-hook 'server-switch-hook 'magit-commit-diff)
                (setq magit-refresh-verbose t)
                (setq magit-save-repository-buffers nil)
                (setq magit-log-arguments '("--graph" "--color" "--decorate" "-n256"))
                (setq magit-view-git-manual-method 'man)
                (setq vc-handled-backends nil)))
    #+END_SRC
*** magit-todo

    Include TODO, etc in the magit buffer

    #+BEGIN_SRC emacs-lisp
            (use-package magit-todos
              :after magit
              :ensure t
              :config (magit-todos-mode))
    #+END_SRC
*** forge
    This implements an interface to github that
    integrates with magit

    #+BEGIN_SRC emacs-lisp
      (use-package forge
        :disabled t
        :after magit)
    #+END_SRC
*** multiple-cursors
    
    You can place multiple cursors in a buffer
    and have whatever you do affect each item
    #+BEGIN_SRC emacs-lisp
    (use-package multiple-cursors
      :bind (("C-. e" . mc/edit-lines)
             ("C-. >" . mc/mark-next-like-this)
             ("C-. <" . mc/mark=previous-like-this)))
    #+END_SRC

*** ag
    A fast search across lots of files.  Relies
    on package silver searcher for the executable
    to be installed.

    #+BEGIN_SRC emacs-lisp
    (use-package ag
      :ensure t
      :bind (("C-c f" . ag))
      :config (setq ag-reuse-buffers t))
    #+END_SRC
  
*** pw-misc
    
    Some commands I find useful
    
    #+BEGIN_SRC emacs-lisp
    (use-package pw-misc
      :after compile
      :config
      (add-hook 'compilation-mode-hook 'pw/no-line-column-number))
    #+END_SRC

    #+BEGIN_SRC emacs-lisp
    (use-package pw-misc
      :bind (("C-c p" . pw/prev-frame)
             ("C-c \\" . pw/reindent)
             ("C-c e" . pw/eval-region-or-defun)))
    #+END_SRC

*** pw-trunc-lines
    
    Toggle truncation of long lines
    #+BEGIN_SRC emacs-lisp
    (use-package pw-trunc-lines
      :commands pw/trunc-lines
      :bind ("C-c $" . pw/trunc-lines)
      :init
      (progn
        (add-hook 'prog-mode-hook 'pw/trunc-lines)
        (add-hook 'makefile-gmake-mode-hook 'pw/trunc-lines)
        (add-hook 'compilation-mode-hook 'pw/trunc-lines)
        (add-hook 'shell-mode-hook 'pw/trunc-lines)))
    #+END_SRC

*** shell-switch
    
    Pete's hack to make switching to a shell buffer
    faster.

    DISABLED.  Trying out counsel-switch-shell-buffer
    #+BEGIN_SRC emacs-lisp
      (use-package shell-switch
        :disabled t
        :commands (shell-switch shell-switch-other-window)
        :init
        (progn
          (bind-key* "C-c s" 'shell-switch)
          (bind-keys* :prefix-map clt-c-4-keymap
                      :prefix "C-c 4"
                      ("s" . shell-switch-other-window))))
    #+END_SRC

*** treemacs
    #+BEGIN_SRC emacs-lisp
    (use-package treemacs
      :ensure t
      :bind (("C-x p" . treemacs-select-window)
             ("C-x t" . treemacs))
      :config
      (progn
        (defun pw/treemacs-ignore (file path)
          (string-match-p "\\.pyc$\\|\\.sundev1\\.\\|\\.o$\\|\\.d$\\|__pycache__" file))
        (add-hook 'treemacs-ignored-file-predicates 'pw/treemacs-ignore)
        (setq treemacs-show-hidden-files nil)
        (setq treemacs-collapse-dirs 2)))
    #+END_SRC

