main-init.org
*** wgrep
    This lets you save the results from grep, edit those results and then
    saving the changes applies them to each file.
    #+BEGIN_SRC emacs-lisp
    (use-package wgrep
      :defer 5
      :ensure t)
    #+END_SRC

*** zoom-frm
    
    Much like face-remap that adds test-scale-increase and
    text-scale-decrease I use this to change the entire window
    instead of the buffer
    #+BEGIN_SRC emacs-lisp
    (use-package zoom-frm
      :bind* (("C-c [" . zoom-frm-out)
              ("C-c ]" . zoom-frm-in)))
    #+END_SRC

*** powerline
    
    Make the modeline have lots of pretty graphics.

    For `iterm2` I had to install some extra fonts
    for these to look good:

         https://github.com/powerline/fonts

    
    #+BEGIN_SRC emacs-lisp
    (use-package powerline
      :config
      (progn
        (powerline-default-theme)))
    #+END_SRC

*** overcast-theme (disabled)
    #+BEGIN_SRC emacs-lisp
      (use-package overcast-theme
        :disabled t
        :ensure t
        :config
        (load-theme 'overcast t))
    #+END_SRC

*** ample theme (disabled)
    #+BEGIN_SRC emacs-lisp
      (use-package ample-theme
        :disabled t
        :ensure t
        :config
        (load-theme 'ample t))
    #+END_SRC
*** nord theme
    I've been trying to find a theme that works well
    with iterm2, emacs-25 and emacs-26.

    If using iterm, you should change it to use following
    color scheme:

    https://github.com/arcticicestudio/nord-iterm2

    #+BEGIN_SRC emacs-lisp
      (use-package nord-theme
        :ensure t
        :config
        (progn
          (setq nord-region-highlight 'snowstorm)
          (setq nord-uniform-mode-lines nil)
          (load-theme 'nord t)))
    #+END_SRC
** Various preferences

   Allow narrow to region (e.g. =C-X n n=)
   #+BEGIN_SRC emacs-lisp
   (put 'narrow-to-region 'disabled nil)
   #+END_SRC

   Force Mac OS X to use Consolas at 16pt
   #+BEGIN_SRC emacs-lisp
   (if (eq (window-system) 'ns)
       (custom-set-faces '(default ((t (:height 160 :family "Consolas"))))))
   #+END_SRC

*** Clean startup

    Do not display message in the scratch buffer or the startup message
    or the message in the echo area
    #+BEGIN_SRC emacs-lisp
    (setq initial-scratch-message "")
    (setq inhibit-startup-screen t)
    (setq inhibit-startup-echo-area-message "pware")
    #+END_SRC

*** Configure the mode line

    Turn on displaying the date and time in the mode line.
    Enable displaying the line and column numbers in the mode line
    But don't do that if the buffer is >250k
    Do not blink the cursor
    #+BEGIN_SRC emacs-lisp
    (setq display-time-day-and-date t)
    (setq line-number-display-limit 250000)
    (display-time-mode)
    (line-number-mode 1)
    (column-number-mode 1)
    (size-indication-mode 1)
    (blink-cursor-mode -1)
    #+END_SRC

*** Legacy (or I've been using emacs for too long)

    If at beginning of line, the Ctl-K kills including the newline
    (I'm hardwired to type Ctl-K twice)

    ;(setq kill-whole-line t)


    Latest Emacs can wrap lines at word boundaries and will move the cursor
    so it stays in the same column on screen.  I'm too used to the old style.
    #+BEGIN_SRC emacs-lisp
    (setq-default word-wrap nil)
    (setq line-move-visual nil)
    (setq visual-line-mode nil)
    #+END_SRC

*** Tune scrolling behaviour

    Make it so moving up or down does it one line at a time.

    - ~scroll-step~ 0 works better with Emacs which now supports
      ~scroll-conservatively~.
    - ~scroll-conservatively~ when > 100 then Emacs scrolls just
      enough to make point visible.  This actuall works well 
      for shell buffers but I also like it other places.
    - ~scroll-margin~ says to keep this many lines
       above or below so you get some context.
    - ~scroll-preserve-screen-position~ says when scrolling pages, keep
      point at same physical spot on screen.
    #+BEGIN_SRC emacs-lisp
    (setq scroll-step 0)
    (setq scroll-conservatively 101)
    (setq scroll-margin 0)
    (setq scroll-preserve-screen-position 'keep)
    #+END_SRC
    
    I set horizontal scrolling because I'd have trouble with
    long lines in shell output.  This seemed to get
    them to display faster by actually slowing things down
    
    - ~hscroll-margin~ is how close cursor gets before
      doing horizontal scrolling
    - ~hscroll-step~ is how far to scroll when marg is reached.

    #+BEGIN_SRC emacs-lisp
    (setq hscroll-margin 1)
    (setq hscroll-step 5)
    #+END_SRC

*** Incremental search highlighting
    Incremental search settings
    #+BEGIN_SRC emacs-lisp
      (setq lazy-highlight-max-at-a-time 10)
      (setq lazy-highlight-initial-delay .25)
      (setq lazy-highlight-interval 0)
    #+END_SRC

*** Misc settings
    Cause the gutter to display little arrows and
    boxes if there is more to a file
    #+BEGIN_SRC emacs-lisp
    (setq-default indicate-buffer-boundaries 'left)
    (setq-default indicate-empty-lines t)
    #+END_SRC

    Even though I did something with the mouse do not
    popup a dialog box but prompt from the mode line
    #+BEGIN_SRC emacs-lisp
    (setq use-dialog-box nil)
    #+END_SRC

    This _sounds_ like something that should be nil but
    the reality is that when user input stops redisplay
    a bunch of screen optimizations are lost.  The
    default is prior to emacs-24 is nil
    #+BEGIN_SRC emacs-lisp
    (setq redisplay-dont-pause t)
    #+END_SRC

    I found visiting a file to be really slow and realized
    it was from figuring out the version control
    #+BEGIN_SRC emacs-lisp
    (setq vc-handled-backends nil)
    #+END_SRC

    I don't like actual tabs being inserted
    #+BEGIN_SRC emacs-lisp
    (setq-default indent-tabs-mode nil)
    #+END_SRC

** X11 configuration

*** ~/.Xdefaults: Configuring X11 (optional)
   
   In my ~/.Xdefaults I have these lines
   #+BEGIN_EXAMPLE
Emacs*background: grey15
Emacs*foreground: grey90
Emacs*pointerColor: green
Emacs*cursorColor: grey90
Emacs.geometry: 135x65+50+0
Emacs.verticalScrollBars: off
Emacs.toolBar: 0
! Try this to list all potential server side fonts:
!     $ xlsfonts -fn '*-*-*-*-*-*-*-*-*-*-*-m*'
!     $ xlsfonts -fn '*-*-*-*-*-*-*-*-*-*-*-c*'
! The "m" means monospace; "c" for character cell.
!
! You want this to be "loose" enough to handle bold and oblique.
! The "140" is point size time 10 (e.g. 14 points); "100" is
!Emacs.font: -adobe-courier-*-*-normal--*-170-100-*-m-*-iso8859-1

! Or if in linux with real fonts
! fc-list :spacing=mono
! fc-list :space=cell
Emacs.font: Bitstream Vera Sans Mono-16
   #+END_EXAMPLE

*** Cut and Paste
    Weird X11 stuff with the cut-and-paste.  I think these settings
    provide the best compromise.

    The world uses what is called a clipboard for copy-and-paste.  X11
    had a more flexible arrangement with a primary cut buffer that some
    X11 older clients still use.  Older clients typically means xterm
    and mrxvt.

    In Exceed, you need to set the config so that the "X Selection" tab
    has the "X Selection Associated with Edit Operations:" be
    "CLIPBOARD".

    The following puts killed text into the clipboard which makes it
    avaiable for all Windows clients given the above Exceed setting.
    #+BEGIN_SRC emacs-lisp
    (setq x-select-enable-clipboard t)
    #+END_SRC

    The following puts killed text into the X11 primary cut buffer.
    Text copied in an xterm can either be pasted into emacs with a
    middle-mouse or the usual yank operations like =C-y=.  You cannot
    paste such text into other Window's applications without going through
    emacs.  Usualy middle mouse button in an xterm pastes the text
    from emacs.
    #+BEGIN_SRC emacs-lisp
    (setq x-select-enable-primary t)
    #+END_SRC

    
    Alternatively, in Exceed, set the "X Selection Associated with
    Edit Operations:" to be "PRIMARY" and use these settings.  This lets
    older xterm/mrxvt co-exist with Windows applications.
    
    To copy to an xterm use left-mouse to select the text in emacs and
    then usual paste with middle-mouse to paste to the xterm.
    
    #+BEGIN_SRC emacs-lisp
    ;(setq x-select-enable-clipboard nil)
    ;(setq x-select-enable-primary t)
    #+END_SRC

    Do not beep if I kill text in a read-only buffer
    #+BEGIN_SRC emacs-lisp
    (setq kill-read-only-ok t)
    #+END_SRC

    Usually, my home directory is faster for saving files
    then anywhere else.
    #+BEGIN_SRC emacs-lisp
    (setq backup-directory-alist '(("." . "~/.backups")))
    #+END_SRC

    Make it so selecting the region highlights it and causes many
    commands to work only on the region
    #+BEGIN_SRC emacs-lisp
    (setq transient-mark-mode t)
    #+END_SRC

    Ignore some other file extensions
    #+BEGIN_SRC emacs-lisp
    (setq completion-ignored-extensions (append completion-ignored-extensions '(".d" ".dd" ".tsk")))
    #+END_SRC
** Disabled packages
   I've disabled these packages for various reasons.  I'm
   not sure why I leave them around.
*** atomic-chrome
    You must first install Atomic Chrome extension from Chrome Web
    Store and this allows editting text areas in Chrome via
    a two-way connection.
    #+BEGIN_SRC emacs-lisp
      (use-package atomic-chrome
        :disabled t
        :config
        (atomic-chrome-start-server))
    #+END_SRC

