main-init.org
*** autorevert (disabled)
    Cause the buffer to be automatically update when the
    file changes.
   
    - *DISABLED*.  I found the emacs display would stop refreshing
                   after a number of files were loaded.

    #+BEGIN_SRC emacs-lisp
    (use-package autorevert
      :disabled t
      :delight auto-revert-mode
      :config
      (setq auto-revert-check-vc-info t)
      (global-auto-revert-mode))
    #+END_SRC
*** avy
    Fast way to jump to a specific character.  Prompts for
    a character and then displays all of them but replaced
    with leters a,b,c,...  You then type in which one to jump
    to.

    - *DISABLED*.  I didn't use this and wanted the M-s binding
      back
    #+BEGIN_SRC emacs-lisp
          (use-package avy
            :disabled t
            :ensure t
            :bind (("M-s" . avy-goto-word-1))
            :config (setq avi-all-windows nil))
    #+END_SRC

*** cua-base (disabled)
    If you like windows style cut and paste then try this.  ^C & ^X only
    work when region is active, ^V and ^Z do paste and undo
     
    - *DISABLED* (I hate this)
    #+BEGIN_SRC emacs-lisp
    (use-package cua-base
      :disabled t
      :config
      (cua-mode 1))
    #+END_SRC

*** fancy-narrow
    Causes narrow region to dim the
    rest of the buffer giving a much
    more natual look.

    *DISABLED* as it hangs on large files

    #+BEGIN_SRC emacs-lisp
      (use-package fancy-narrow
        :disabled t
        :delight fancy-narrow-mode
        :config
        (fancy-narrow-mode 1))
    #+END_SRC

*** hl-line (disabled)
    `global-hl-line-mode' highlights the current line.  You should make sure
    that `hl-line-face' is an appropriate, subtle color.  The sticky
    flag keeps it highlighted in all windows
    
    - *DISABLED* (trying out beacon-mode which briefly highlights line)
    #+BEGIN_SRC emacs-lisp
    (use-package hl-line
      :disabled t
      :config
      (progn
        (setq hl-line-sticky-flag t)
        (setq global-hl-line-sticky-flag t)
        (global-hl-line-mode 1)))
    #+END_SRC

*** ido (disabled)
    
    Use a fancy auto-complete for buffers and files
    
    - *DISABLED* using ivy

    #+BEGIN_SRC emacs-lisp
    (use-package ido
      :disabled t
      :defer 5
      :config
      (progn
        (setq ido-default-buffer-method 'selected-window)
        (setq ido-default-file-method 'selected-window)
        (setq ido-enable-flex-matching t)
        (setq ido-enable-dot-prefix t)
        (setq ido-enable-tramp-completion t)
        (setq ido-max-directory-size 100000)
        (setq ido-rotate-file-list-default t)
        (setq ido-enter-matching-directory 'first)
        (setq ido-use-virtual-buffers t)
        ;(setq ido-use-virtual-buffers 'auto)
        ;(setq ido-separator "|")
        (setq ido-ignore-files (append ido-ignore-files '("\\`00" "\\'*.tsk")))
        (setq ido-ignore-buffers
              (list "\\` " ".*Completions.*" "\\*Buffer List\\*" "\\*Messages\\*"))
        (setq ido-work-directory-list-ignore-regexps
              (list "/bb/bin" "/bb/data" "/bb/data/tmp" "/bbsrc/apputil"))
        (ido-mode 1)))
    #+END_SRC

*** ido-vertical (disabled)
    Causes ido-mode to display completions vertically
    and =Ctl n= and =Ctl p= move down and up in list

    #+BEGIN_SRC emacs-lisp
    (use-package ido-vertical-mode
      :after ido
      :defer 30
      :ensure t
      :disabled t
      :config
      (ido-vertical-mode 1))
    #+END_SRC

*** iswitchb (disabled)
    
    `iswitchb-mode' provides a nice completion for switching between
    buffers.  The `iswitchb-use-virtual-buffers' and `recentf-mode'
    adds recent files to the match
    
    - *DISABLED* (use ido instead)

    #+BEGIN_SRC emacs-lisp

    (use-package iswitchb
      :disabled t
      :config
      (progn
        (setq iswitchb-default-method 'samewindow
              iswitchb-max-to-show 5
              iswitchb-use-virtual-buffers t)
        (recentf-mode 1)
        (iswitchb-mode 1)))
    #+END_SRC

*** menu-bar (disabled)
    Turn the menubar off.
    
    - *DISABLED* (Turns out I like the menu-bar!)

    #+BEGIN_SRC emacs-lisp
    (use-package menu-bar
      :disabled t
      :config
      (menu-bar-mode -1))
    #+END_SRC

*** diminish (disabled)
    Do not display these minor modes in mode-line

    #+BEGIN_SRC emacs-lisp
    (use-package diminish
      :disabled t
      :config
      (diminish 'abbrev-mode))
    #+END_SRC

*** git-getter-fringe+ (disabled)
    Display lines that have changed in the left margin.
    This works with linum-mode but not in a tty
    
    - *DISABLED* (slow loading)

    #+BEGIN_SRC emacs-lisp
    (use-package git-gutter-fringe+
      :disabled t
      :config (progn
                (setq git-gutter-fr+-side 'right-fringe)
                (global-git-gutter+-mode)))
    #+END_SRC

*** linum
    Make it so line numbers show up in left margin Used in C/C++
    mode.  (Tried nlinum but had refresh problems)

    #+BEGIN_SRC emacs-lisp
      (use-package linum
        :if (not (featurep 'display-line-numbers))
        :config (progn (setq linum-format "%5d ")
                       (add-hook 'prog-mode-hook 'linum-mode)))
    #+END_SRC

*** magithub (disabled)
    Interact with github via magit
    
    - *DISABLED* (slow loading)
    #+BEGIN_SRC emacs-lisp
    (use-package magithub
      :after magit
      :disabled t
      :config
      (magithub-feature-autoinject t))
    #+END_SRC

*** nlinum (disabled)
    Make it so line numbers show up in left margin
    
    - *DISABLED* (refresh problems on Mac OS X)

    #+BEGIN_SRC emacs-lisp
    (use-package nlinum
      :disabled t
      :commands nlinum-mode
      :init (add-hook 'prog-mode-hook 'nlinum-mode))
    #+END_SRC

*** fill-column-indicator (disabled)
    
    Make a vertical bar show at fill-column
    
    - *DISABLED* (didn't like it anymore)
    #+BEGIN_SRC emacs-lisp
    (use-package fill-column-indicator
      :disabled t
      :commands (fci-mode)
      :init (add-hook 'prog-mode-hook 'fci-mode))
    #+END_SRC
  
*** num3-mode (disabled)
    
    Make long strings of digits alternate groups of 3 with bold.
    
    - *DISABLED* (I got tired of this highlight)
    #+BEGIN_SRC emacs-lisp
    (use-package num3-mode
      :disabled t
      :ensure t
      :commands num3-mode
      :delight num3-mode
      :init (add-hook 'prog-mode-hook 'num3-mode)
      :config (make-face-bold 'num3-face-even))
    #+END_SRC

*** color-identifiers-mode (disabled)
    
    Make each variable in a different color
    
    - *DISABLED* (too many colors)
    #+BEGIN_SRC emacs-lisp
    (use-package color-identifiers-mode
      :disabled t
      :delight color-identifiers-mode
      :init
      (add-hook 'prog-mode-hook
                'color-identifiers-mode)
      :delight color-identifiers-mode)
    #+END_SRC

*** rainbow-identifiers (disabled)
    
    Make each variable a different color
    
    - *DISABLED* (using color-identifies-mode instead)
    #+BEGIN_SRC emacs-lisp
    (use-package rainbow-identifiers
      :disabled t
      :config
      (progn
        (add-hook 'prog-mode-hook
                  'rainbow-identifiers-mode)))
    #+END_SRC

*** scroll-bar
    
    Turn off the scroll bars

    #+BEGIN_SRC emacs-lisp
    (use-package scroll-bar
      :defer 1
      :disabled t
      :config
      (scroll-bar-mode -1))
    #+END_SRC

*** smart-mode-line (disabled)
    
    Smart mode line displays a more graphical modeline.
    
    DISABLED (Use powerline mode instead)
    #+BEGIN_SRC emacs-lisp
    (use-package smart-mode-line
      :disabled t
      :config
      (progn
        (setq sml/theme 'dark)
        (sml/setup)))
    #+END_SRC

*** sublime-themes (disabled)
    I like the wilson theme from the sublime-themes
    package.
    #+BEGIN_SRC emacs-lisp
    (use-package sublime-themes
      :disabled t
      :ensure t
      :config
      (load-theme 'wilson t nil))
    #+END_SRC

*** dracula-theme (disabled)
    #+BEGIN_SRC emacs-lisp
    (use-package dracula-theme
      :disabled t
      :ensure t
      :config
      (load-theme 'dracula t nil))
    #+END_SRC

